[
    {
        "courseID": "ddc69c4d-0aa2-4649-8d46-589786fbe0a4",
        "name": "Starting Out",
        "description": "A rudimentary course for beginners to begin their Spanish learning journey",
        "userAccess": true,
        "courseProgress": 0.0,
        "completed": false,
        "lessons": [
            {
                "lessonName": "Storytelling",
                "lessonID": "7479de25-c6c0-4701-abaf-a25f75f98f3f",
                "lessonProgress": 0.0,
                "description": "Greetings and opening phrases, Introducing yourself and Others, Days of the Week and Seasons, Family Members",
                "spanishContent": "Title: Family Morning Routine - Una mañana, la familia Méndez se estaba preparando para ir a la escuela. Mía, la hija, tenía que cepillarse los dientes, cepillarse el pelo, desayunar y vestirse. El hijo, Juan, tenía que cepillarse los dientes, desayunar y preparar su mochila. La mamá preparaba la comida y el papá los acompañaba a la escuela.",
                "englishContent": "Title: Family Morning Routine - One morning, the Mendez family was getting ready for school. Mia, the daughter, had to brush her teeth, brush her hair, eat breakfast, and get dressed. Juan, the son, had to brush his teeth, eat breakfast, and pack his backpack. Mom made the food, and Dad walked them to school."
            }
        ],
        "flashcards": [
            {
                "flashcardName": "Flashcards",
                "flashcardId": "f524c736-31e0-4960-a810-0595f93b60f7",
                "completed": false,
                "flashcardProgress": 0.0
            }
        ]
    },
    {
        "courseID": "1c9d7241-30d0-4f50-91c1-f4c6e3c98eb2",
        "name": "Grammar Basics",
        "description": "A comprehensive course designed for advanced learners to enhance their Spanish skills.",
        "userAccess": true,
        "courseProgress": 0.0,
        "completed": false,
        "lessons": [
            {
                "lessonName": "Complex Conversations",
                "lessonID": "f473fe60-b30b-4c8b-967b-bf563f104504",
                "lessonProgress": 0.0,
                "description": "In-depth discussions on various topics, cultural nuances, and advanced vocabulary.",
                "spanishContent": "Título: La Aventura de Clara - Clara era una joven apasionada por la fotografía. Un día, decidió emprender un viaje a través de los paisajes de Andalucía, donde las colinas se encontraban con el mar y la historia respiraba en cada rincón.",
                "englishContent": "Title: Clara's Adventure - Clara was a young woman passionate about photography. One day, she decided to embark on a journey through the landscapes of Andalusia, where the hills met the sea and history breathed in every corner."
            }
        ],
        "flashcards": [
            {
                "flashcardName": "Flashcard 2",
                "flashcardId": "ee332b2c-2dc7-4852-b21c-3cc6cecd2807",
                "completed": false,
                "flashcardProgress": 0.0
            }
        ]
    }
]